# Why Data Structure??
* To be sure we are not guessing while writing the Python Syntax.
* For better clarity few Legitimate examples are given below

In [1]:
# In order to create the dataframe by oneself. (In the below case using the List) 
import pandas as pd

sales = [{'account': 'Jones LLC', 'Jan': 150, 'Feb': 200, 'Mar': 140},
         {'account': 'Alpha Co',  'Jan': 200, 'Feb': 210, 'Mar': 215},
         {'account': 'Blue Inc',  'Jan': 50,  'Feb': 90,  'Mar': 95 }]
df = pd.DataFrame(sales,index = None)
print (df)

   Feb  Jan  Mar    account
0  200  150  140  Jones LLC
1  210  200  215   Alpha Co
2   90   50   95   Blue Inc

In [2]:
# Now above Feb,Jan,Mar and account are the column names. we want to change Mar to May.
df.rename(columns = {'Mar':'May'})

   Feb  Jan  May    account
0  200  150  140  Jones LLC
1  210  200  215   Alpha Co
2   90   50   95   Blue Inc

In [9]:
# now in below case creating the dataframe(table) from the lists.
import sys
sales = [('account', ['Jones LLC', 'Alpha Co', 'Blue Inc']),
         ('Jan', [150, 200, 50]),
         ('Feb', [200, 210, 90]),
         ('Mar', [140, 215, 95]),
         ]
df = pd.DataFrame.from_dict(dict(sales))
df      # (just checking out wheter it came or not)

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [4]:
# another example. just defined the new list in this case.
check = ['Sanskruti','Nikita','Vishak','Mumbai']

In [5]:
#  now letting those four names on as the new column headers
df.columns = check
df

   Sanskruti  Nikita  Vishak  Mumbai
0  Jones LLC     150     200     140
1   Alpha Co     200     210     215
2   Blue Inc      50      90      95

<div class="alert alert-info">
*Questions and Answers.*
</div>
* Once the session gets over, please search for two real use cases of tuples for data science?